Repository: seanpm2001/mt-training-data
Catalog: st/st_pontoon.tmx
Source language: en_us
Languages: st

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
st: Boholo ba di-database tsa puo di kwetlisitswe ka boemedi bo fetelletseng ba dintlha tsa palo ya batho e itseng e leng se bakang leeme ho <articleLink>banna le ba maemo a ditjhelete a mahareng</articleLink>. Ditsela tsa puo le maleme a atisang ho ba le boemedi bo fokolang kahare ho dipokello tsa data tsa kwetliso ka tlwaelo a amahanngwa le dihlopha tsa batho tse se ntse di kgethollwa. Metjhini e mengata e boela e thatafallwa ke ho utlwa mantswe a basadi. Ke ka hoo re batlang mefuta e fapaneng ho database ya mantswe!

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
st: Mozilla Common Voice ke mohato wa ho thusa ho ruta metjhini hore na batho ba nnete ba bua jwang.

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
st: Mozilla Common Voice e entswe ke mefuta-futa ya ditjhaba tsa baitseki, ditsebi tsa puo, boramahlale ba data, barutehi le dienjiniere tsa software ho tswa hohle lefatsheng. Morero ona o tsamaiswa ke Motheo wa Mozilla.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
st: Mozilla e ikemiseditse ho boloka marang-rang a butswe ebile a fumaneha ho bohle. Ho etsa jwalo re hloka ho matlafatsa baetsi ba marang-rang ka merero e kang Common Voice. Ha dithekenoloji tsa lentswe di ntse di kenella tshebetsong ho feta, re dumela hore di tlameha ho sebeletsa basebedisi bohle ka ho lekana. Hona ho bolela ho tsetela dipuong tse ngata le ho amohela ditsela tsa puo tse fapaneng le batho ba fapaneng ha ho hahwa ​​​​le ho lekola dithekenoloji tsa lentswe. Common Voice ke sesebediswa sa setjhaba se fumanehang ho bohle, mme dihlopha tsa Mozilla le dihahi tsa marang-rang tsa lefatshe ka bophara di se ntse di e sebedisa le ho merero ya rona.

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
st: Enjene e bitswang Deep Speech e elellwang lentswe e buletsweng bohle ya Mozilla e ka sebediswa ho haha di-application tse elellwang puo. Bala <githubLink>kakaretso ya Github</githubLink>kapa kenela <discourseLink>DeepSpeech Discourse</discourseLink> ho ithuta hore na o qala jwang.

source: Mutual accountability.
st: Boikarabello ka kopanelo.

source: My Sentences
st: Dipolelo tsa ka

source: Name
st: Lebitso

source: Names of your language
st: Mabitso a puo ya hao

source: Native Language
st: Puo ya Letswele

source: Need some help with accent?
st: O hloka thuso ka mokgwa wa ho bua?

source: Need some help with variants?
st: O hloka thuso ka mefuta e fapaneng?

source: Need to download your data?
st: O hloka ho downlad-a data ya hao?

source: New Language Launch
st: Ho Qala Puo e Ntjha

source: Next
st: E latelang

source: Next Goals: { $goal }
st: Dipheo tse Latelang: { $goal }

source: No
st: Tjhe

source: [No ‘a’ in the original text]
st: [Ha ho ‘a’ mongolong wa pele]

source: No gravatar found for your email
st: Ha ho gravatar e fumanweng bakeng sa imeile ya hao

source: No microphone found.
st: Ha ho maekerofounu e fumanweng.

source: No rejected sentences found!
st: Ha ho dipolelo tse hannweng tse fumanweng!

source: Northern Sotho
st: Sesotho sa Lebowa

source: No sentences found!
st: Ha ho dipolelo tse fumanweng!

source: No sentences to review. <addLink>Add more sentences now!</addLink>
st: Ha ho na dipolelo tsa lokelwang ho hlahlojwa. <addLink>Kenya dipolelo tse ding hape hona jwale!</addLink>

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
st: Tlhokomediso: Ha e behetswe ho 'Bonahala', tlhophiso ena e ka fetolwa ho tswa ho <profileLink>Leqephe la Profaele</profileLink>

source: Note: You will still need to select between Speak or Listen to change contribution type.
st: Tlhokomediso:O ntse o tla hloka ho kgetha pakeng tsa ho Bua kapa ho Mamela ho fetola mofuta wa monehelo.

source: No Thanks
st: Tjhe Kea Leboha

source: No variant selected
st: Ha ho mofuta o kgethilweng

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
st: Kaha jwale o tseba haholwanyane ka Common Voice, ke hobaneng o sa e leke? Penya letshwao la maekerofounu ho qala ho bala dipolelo ka lentswe le phahameng.<br/><br/> Haeba o kgetha ho hlahloba ditlatsetso tsa lentswe tsa batho ba bang, penya ho letshwao la bapala. O tla thusa ho netefatsa hore direkoto di dumellana le dipolelo tse ngotsweng screen-eng.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
st: Hona jwale o ka fana ka lentswe la hao ho re thusa ho haha database ya lentswe e buletsweng bohle yeo mang kapa mang a ka e sebedisang ho etsa disebediswa tse ntjha tsa disebediswa le marang-rang. Bala polelo ho thusa metjhini ho ithuta kamoo batho ba phelang ba buang. Sheba mosebetsi wa bafani ba bang ho ntlafatsa boleng. Ho bonolo jwalo!

source: Number of Voices
st: Palo ya Mantswe

source: Numbers. There should be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
st: Dinomoro. Ha hwa lokela hoba teng dinomoro ho sengolwa-sa-mathomo hobane di ka baka mathata ha di ballwa hodimo. Mokgwa wo nomoro e balwang o ipapisitse le moelelo mme o ka tlisa pherekanyo kahare ho pokello ya data. Mohlala, nomoro "2409" e ka balwa ka nepo e le "mashome a mane noto robong" le "dikete tse pedi makgolo a mane le metso e robong".

source: Off
st: E kwetswe

source: Offensive language
st: Puo e kgopisang

source: Offensive speech
st: Puo e kgopisang

source: On
st: E butswe

source: Once logged in you can select your languages from the profile section.
st: Ha o se o kene o ka kgetha dipuo tsa hao ho tswa karolong ya profaele.

source: On desktop devices you can contribute by downloading…
st: Ho disebediswa tsa desktop o ka kenya letsoho ka ho download-a...

source: One sentence per line
st: Polelo e le nngwe moleng

source: On his head he wore a beret.
st: Hloohong o ne a rwetse berete.

source: On iOS please continue with Safari to enable recording…
st: Ho iOS tswelapele ka Safari ho dumella ho rekota…

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
st: Ka lehlakoreng le leng, haeba o nahana hore mohlomong mmali ha a e-s'o ka a kopana le lentswe pele, mme o mpa a nahana ka mokgwa o fosahetseng oa ho bitsa mantswe, ka kopo, hana. Haeba o sena bonnete, sebedisa konopo ya tlola.

source: Optionally join on our email list for updates and new information about the project.
st: Ka boikgethelo kena lenaneng la rona la mangolo bakeng sa ditlaleho le dintlha tse ntjha mabapi le morero.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
st: Dintlha tsa palo ya batho tse rometsweng ka boikgethelo (mohlala, dilemo, bong, puo, le tsela ya puo) di ke ke tsa phatlalatswa ho profaele ya hao, mme di ke ke tsa hokelwa ho ak'haonte ya hao kahara pokello ya data. Dikotwana tsa audio ka bonngwe di tla amahanngwa le dintlha tsa palo ya batho bakeng sa tlhahlobo e nepehahetseng - mohlala, mofuputsi a ka batla ho lebisa model o kwetlisang ho karolo e itseng ya palo ya batho.

source: Other
st: Tse ding

source: Other Language
st: Puo e nngwe

source: Other people validate those voice clips.
st: Batho ba bang ba netefatsa di-clip tseo tsa mantswe.

source: Other voice datasets…
st: Dipokello tsa data tse ding

source: Other Voice Datasets
st: Dipokello tsa Data tse Ding

source: Our community manager will reach out to you to offer extra support, and to let you know if there is already a community working on your language
st: Mookamedi wa rona wa setjhaba o tla ikopanya le wena ho fana ka tshehetso e eketsehileng, le ho o tsebisa haeba ho so ntso na le setjhaba se se ntse se sebetsa ka puo ya hao

source: Our governance is founded on the pillars of:
st: Puso ya rona e thehilwe hodim'a ditshiya tsa:

source: Our source text is made up of original contributor donations as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life</italic>. You can view our source sentences in this <githubLink>GitHub folder</githubLink>.
st: Sengolwa-sa-mathomo sa rona se entswe ka menehelo ya bafani ba mantlha hammoho le dipuisano tse tswang ho dingodilweng tsa difilimi tsa setjhaba tse kang <italic>It's a Wonderful Life</italic>. O ka sheba dipolelo-tsa-mathomo tsa rona ho <githubLink>faele ya GitHub</githubLink>.

source: Overall Accuracy
st: Ho Nepa Ka Kakaretso

source: Overall Hr. Total
st: Kakaretso ya Dihora Kaofela

source: Overall project status: see how far we’ve come!
st: Boemo ba morero bo akaretsang: bona na re tlile hole hakakang!

source: Partners
st: Balekane

source: Partnerships and networks
st: Dikamano le marang-rang

source: Partner with local organizations or individuals
st: Sebedisana le mekgatlo ya lehae kapa batho ka bomong

source: [Part of the text can’t be heard]
st: [Karolo e nngwe ya mongolo ha e utluwe]

source: Past recordings download requests
st: Dikopo tsa ho download-a direkoto tse fetileng

source: <p>Common Voice is a publicly available voice dataset, powered by the voices of volunteer contributors around the world. People who want to build voice applications can use the dataset to train machine learning models.</p> <p>At present, most voice datasets are owned by companies, which stifles innovation. Voice datasets also underrepresent: non-English speakers, people of colour, disabled people, women and LGBTQIA+ people. This means that voice-enabled technology doesn’t work at all for many languages, and where it does work, it may not perform equally well for everyone. We want to change that by mobilising people everywhere to share their voice.</p>
st: <p>Common Voice ke pokello ya data ya mantswe e fumanehang phatlalatsa, e matlafatswang ke mantswe a bafani ba ithaopileng lefatshe ka bophara. Batho ba batlang ho haha disebediswa tsa lentswe ba ka sebedisa pokello ya data ho kwetlisa di-model tsa ho ithuta ka motjhini.</p> <p>Hajwale, boholo ba dipokello tsa data di ruilwe ke dikhamphani, tse kginang ho etswa ha dintho tse ntjha. Dipokello tsa data tsa mantswe di boela ha di emele hantle: batho ba sa buueng Sekgowa, batho ba mmala, batho ba nang le bokowa, basadi le batho ba LGBTQIA+. Hona ho bolela hore thekenoloji e sebetsang ka mantswe ha e sebetse ho hang bakeng sa dipuo tse ngata, mme le moo e sebetsang, ha e sebetse hantle ka tekano bakeng sa bohle. Re batla ho fetola hono ka ho bokella batho hohle hore ba arolelane ka mantswe a bona.</p>

source: People come and contribute their voices.
st: Batho ba tla mme ba nehelane ka mantswe a bona.

source: Personal
st: Tsa botho

source: Personal dashboards keep you up-to-date with individual and community progress.
st: Di-dashboard tsa hao di o boloka o le morao-rao mabapi le tswelopele ya motho ka mong le ya setjhaba.

source: <playbookLink>Find helpful guidance</playbookLink> on the entire Common Voice journey, from localisation to dataset usage, as well as how to connect with our community.
st: <playbookLink>Fumana tataiso e thusang</playbookLink> leetong lohle la Common Voice, ho tloha ho localisation ho isa tshebedisong ya pokello ya data, mmoho le mokgwa wa ho hokahana le setjhaba sa rona.

source: <playIcon></playIcon>Last one!
st: <playIcon></playIcon>Ya ho qetela!

source: Play/Stop
st: Bapala/Emisa

source: Please add a source.
st: Ka kopo kenya mohlodi.

source: Please add sentences.
st: Ka kopo kenya dipolelo

source: Please check the <howToLink>guidelines</howToLink>.
st: Ka kopo sheba <howToLink>ditataiso</howToLink>.

source: Please confirm that these sentences are public domain.
st: Ka kopo netefatsa hore dipolelo tsena ke tsa setjhaba.

source: Please select a language.
st: Ka kopo kgetha puo.

source: Please select a language to review sentences.
st: Ka kopo, kgetha puo eo o tla hlahloba dipolelo.

source: Please try again.
st: Ka kopo leka hape

source: <pontoonAccountLink>Create an account</pontoonAccountLink> if you don’t have one. Then, choose your language <strong>(‘Team’)</strong> and then choose the project, <pontoonCvLink>Common Voice</pontoonCvLink>. There will be files to translate. Click on one, then it shows words in English and a box to translate them.
st: <pontoonAccountLink>Etsa ak'haonte</pontoonAccountLink> haeba o se na yona. Ebe, o kgetha puo ya hao <strong>(‘Sehlopha’)</strong> mme ebe o kgetha morero, <pontoonCvLink>Common Voice</pontoonCvLink> . Ho tla ba le difaele tsa ho tolokwa. Penya ho e le nngwe, ebe e tla bontsha mantswe ka Sekgowa le lebokose ho ditoloka.

source: Press play, listen & tell us: did they accurately speak the sentence below?
st: Tobetsa bapala, mamela mme o re bolelle: na ba buile polelo e ka tlase ka nepo?

source: Press { shortcut-play-toggle } to toggle play mode
st: Tobetsa { shortcut-play-toggle } ho fetola mokgwa wa ho bapala

source: Privacy
st: Lekunutu

source: Privacy Policy
st: Leano la Lekunutu

source: Privacy, security and transparency.
st: Lekunutu, tshireletso le ponaletso.

source: Profile
st: Profaele

source: Profile information improves the audio data used in training speech recognition accuracy.
st: Dintlha tsa profaele di ntlafatsa data ya audio e sebediswang ho kwetlisa nepahalo ya temoho ya puo.

source: Profile: { $username }
st: Profaele: { $username }

source: Progress
st: Kgatelopele

source: Punctuation. Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
st: Matshwao a Puo. Matshwao a puo a kgethehileng a kenyelletswe feela ha ho hlokahala. Mohlala, sehonyetso se kenyelletswa mantsweng a sekgowa jwaloka "don't" le " we're" mme a tshwanela ho kenyelletswa ho sengolwa-sa-mathomo, empa ho ka se etsahale hore ebe o tla hloka matshwao a kgethehileng a kang "@" kapa "#".

source: [‘Raised’ in English is always pronounced as one syllable, not two]
st: [‘Ho phahamiswa’ ka Senyesemane kamehla ho bitswa jwalo ka senoko se le seng, eseng tse pedi]

source: Reader Effects
st: Diphello tsa Mmadi

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
st: Ho bala dikgakanyo tse siyo, jwalo ka "We're" ho fapana le "We are", kapa ka tsela e fapaneng.

source: Read More
st: Bala Haholwanyane

source: Read more on our About page
st: Bala haholwanyane ho leqephe la About la rona

source: Read our How-to if unsure how to attribute
st: Bala Mokgwa wa rona wa ho etsa haeba o se na bonnete ba ho etsa

source: Read the sentence carefully - don’t miss, change or add words.
st: Bala polelo ka hloko - seke wa fosa, wa fetola kapa wa eketsa mantswe.

source: { $readyCount } sentences ready for submission!
st: { $readyCount } dipolelo tse seng di loketse ho romellwa!

source: Ready to add your voice or lend your ear?
st: Na o ikemiseditse ho kenya lentswe la hao kapa ho re fa tsebe?

source: Ready to contribute?
st: Na o ikemiseditse ho kenya letsoho?

source: Ready to do { $count } more?
st: O ikemiseditse ho etsa { $count } tse ding?

source: Ready to donate your voice?
st: O ikemiseditse ho nehelana ka lentswe la hao?

source: Ready to help validate sentences?
st: O ikemiseditse ho thusa ho netefatsa dipolelo?

source: reCAPTCHA is required if you want to proceed
st: reCAPTCHA e ya hlokahala haeba o batla ho tswelapele

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
st: Fumana di-imeiletse kang phephetso le dikgopotso tsa sepheo, ditlaleho tsa tswelopele, le dikoranta ka Common Voice.

source: Recorded Clips
st: Di-clip tse Rekotilweng

source: Recorded Hours
st: Dihora tse Rekotilweng

source: <recordIcon></recordIcon> Last one!
st: <recordIcon></recordIcon> Ya ho qetela!

source: [Recording cut off before the end of the last word]
st: [Rekoto e kgaotswe pele lentswe la ho qetela le felella]

source: Recordings
st: Direkoto

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
st: Ho rekota di-ciip tsa lentswe ke karolo ya bohlokwa ya ho aha pokello ya data e bulehileng; ba bang ba ka re ke karolo e monate le yona.

source: Record/Stop
st: Rekota/Ema

source: Record your voice
st: Rekota lentswe la hao

source: Refresh
st: Kgatholla

source: Reject
st: Hana

source: Rejected Sentences
st: Dipolelo tse hannweng

source: { $rejectedSentences } rejected sentences.
st: { $rejectedSentences } dipolelo tse hannweng.

source: Remember that we need permission to publish those sentences, so always ensure that the text belongs to the <wikipediaLink>public domain</wikipediaLink>. If there is no explicit indication, reach out to the person that the text belongs to and ask if they want to contribute their text to the Public Domain. If they want to, help them go through the <cc0WaiverLink>Contributions Agreement</cc0WaiverLink> process. If they do not want to contribute the text, then you are not allowed to use that text.
st: Hopola hore re hloka tumello ho phatlalatsa dipolelo tseo, kahoo kamehla etsa bonnete ba hore sengolwa ke <wikipediaLink>sa setjhaba se phatlalatsa</wikipediaLink>. Haeba ho se letho le bontshang ka ho hlaka, buisana le motho eo sengolwa e leng sa hae mme o botse hore na o batla ho tlatsetsa ka sengolwa sa hae ho Tsa Setjhaba. Haeba ba batla, ba thuse ho kena tshebetsong ya<cc0WaiverLink>Tumello ya Bafani</cc0WaiverLink>. Haeba ba sa batle ho tlatsetsa ka sengolwa, jwale ha wa dumellwa ho sebedisa sengolwa seo.

source: remove
st: tlosa

source: Remove
st: Tlosa

source: Remove Avatar
st: Tlosa Avatar

source: Report
st: Tlaleha

source: Report Bugs
st: Tlaleha bothata bo sa lebellwang

source: Report copyright issues
st: Tlaleha ditaba tsa ditokelo tsa sengodi

source: Report was passed successfully
st: Tlaleho e fetisitswe ka katleho

source: Request a Language
st: Kopa Puo

source: Request recordings
st: Kopa tse rekotilweng

source: *required
st: *E ya hlokahala

source: Re-record
st: Rekota hape

source: Re-record clip
st: Rekota clip hape

source: Reset skipped sentences
st: Seta botjha dipolelo tse tlotsweng

source: Return
st: Kgutla

source: Return here to edit your goal anytime.
st: Kgutlela mona ho hlophisa sepheo sa hao neng kapa neng.

source: Return to Common Voice
st: Kgutlela ho Common Voice

source: Return to Common Voice Datasets
st: Kgutlela ho dipokello tsa data tsa Common Voice

source: Return to Languages
st: Kgutlela ho Dipuo

source: Review
st: Hlahloba

source: Review could not be saved. Please try again later.
st: Maikutlo haa kgona ho bolokwa. Ka kopo leka hape hamorao.

source: ⓘ Review Criteria
st: ⓘ Mekgwa ya Tlhatlhabo

source: Review Criteria
st: Mekgwa ya Tlhatlhobo

source: Reviewed sentences not submitted, are sure?
st: Dipolelo tse hlahlobilweng ha dia romellwa, na o tiile?

source: <reviewLink>Review now!</reviewLink>
st: <reviewLink>Hlahloba hona jwale!</reviewLink>

source: Review & re-record clips here as you go
st: Lekola mme o rekote di-clip hape mona ha o ntse o tswela pele

source: Review & re-record clips if needed
st: Hlahloba le ho rekota di-clip hape ha ho hlokahala

source: Review sentences
st: Hlahloba Dipolelo

source: Review Sentences
st: Hlahloba Dipolelo

source: Review & Submit
st: Hlahloba mme o Kenye

source: Save
st: Boloka

source: Saved
st: E bolokilwe

source: Search
st: Batla

source: Search for answers
st: Batlana le dikarabo

source: Search for them on the Internet
st: Di batle ho marang-rang

source: See how your progress compares to other contributors all over the world.
st: Sheba kamoo tswelopele ya hao e bapiswang le batshehetsi ba bang lefatsheng ka bophara.

source: See Less
st: Sheba hanyane

source: See More
st: Sheba Haholo

source: Select a Language...
st: Kgetha Puo...

source: Selected
st: E kgethilwe

source: Select Language
st: Kgetha Puo

source: Send sign up link
st: Romella sehokelo sa ho ingodisa

source: Sentence Collection
st: Pokello ya Dipolelo

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
st: <sentenceCollectorFragment>Sheba haholwanyane mabapi le pokello ya dipolelo</sentenceCollectorFragment>.

source: <sentenceCollectorVideo>Watch our guide on using the Sentence Collector</sentenceCollectorVideo>.
st: <sentenceCollectorVideo>Sheba tataiso ya rona mabapi le ho sebedisa Mobokelli wa Dipolelo</sentenceCollectorVideo>.

source: Sentence must contain between 1 and 14 (inclusive) words
st: Polelo e tlameha ho ba le mantswe a pakeng tsa 1 le 14 (kakaretso).

source: Sentences
st: Dipolelo

source: { $sentences } added by you
st: { $sentences } tse kentsweng ke wena

source: Sentences are being uploaded. This can take several minutes depending on the number of sentences added. Please do not close this website.
st: Dipolelo di ntse di kenngwa. Sena se ka nka metsotso e mmalwa ho latela palo ya dipolelo tse kentsweng. Ka kopo seke wa kwala sebaka sena sa marang-rang.

source: Sentences are collected for people to read aloud.
st: Dipolelo di bokellwa hore batho ba di balle hodimo.

source: Sentence should not contain abbreviations
st: Polelo ha ya lokela ho ba le dikgutsufatso

source: Sentence should not contain numbers
st: Polelo ha ya lokela ho ba le dipalo

source: Sentence should not contain symbols
st: Polelo ha ya lokela ho ba le matshwao
